
#==========================================================================================#
# >>>>> ПОДКЛЮЧЕНИЕ БИБЛИОТЕК И МОДУЛЕЙ <<<<< #
#==========================================================================================#

from dublib.Methods import WriteJSON


import logging

#==========================================================================================#
# >>>>> НАСТРОЙКА ЛОГИРОВАНИЯ <<<<< #
#==========================================================================================#

logging.basicConfig(level=logging.INFO, filename="LOGING.log", filemode="w")
#==========================================================================================#
# >>>>> СОЗДАНИЕ ПОЛЬЗОВАТЕЛЯ И ДАННЫХ ДЛЯ НЕГО <<<<< #
#==========================================================================================#

class Size:
        
    def __init__(self):
        self.__Size = 0

    def CheckSize(self, FileInfo):
        
        IsChecked = False

        SizeFile = FileInfo.file_size/1024

        if SizeFile < 20480:
            IsChecked = True
            logging.info(f"Размер файла: {SizeFile}.")
        
        return IsChecked 

SizeObject = Size()


