
#==========================================================================================#
# >>>>> СОЗДАНИЕ РАЗМЕРА ФАЙЛОВ <<<<< #
#==========================================================================================#

class Sizer:

    #==========================================================================================#
    # >>>>> КОНСТРУКТОР <<<<< #
    #==========================================================================================#  
      
    def __init__(self):
        self.Units = ['B', 'KB', 'MB', 'GB']
        self.Size = str()

    #==========================================================================================#
    # >>>>> ПРОВЕРКА РАЗМЕРА ФАЙЛА <<<<< #
    #==========================================================================================# 
         
    def CheckSize(self, FileInfo: any)-> bool:
        # Состояние.
        IsChecked = False

        # Размер в KB.
        SizeFile = FileInfo.file_size/1024

        # Если размер больше 20 MB.
        if SizeFile < 20480:
            # Состояние.
            IsChecked = True
        
        return IsChecked 

    
    #==========================================================================================#
    # >>>>> КОНВЕРТЕР РАЗМЕРА ФАЙЛА <<<<< #
    #==========================================================================================#
    def Converter(self, Unit: str, Value: float ) -> float():
        if Unit == "B":
            ResultConvertation = Value 

        if Unit == "KB":
            ResultConvertation = Value/1024 

        if Unit == "MB":
            ResultConvertation = Value/1024/1024 

        if Unit == "GB":
            ResultConvertation = Value/1024/1024 

        return ResultConvertation





        
                
    