#==========================================================================================#
# >>>>> ПОДКЛЮЧЕНИЕ БИБЛИОТЕК И МОДУЛЕЙ <<<<< #
#==========================================================================================#

from dublib.Methods import ReadJSON, WriteJSON


import os

#==========================================================================================#
# >>>>> СОЗДАНИЕ ПОЛЬЗОВАТЕЛЯ И ЕГО ДАННЫХ <<<<< #
#==========================================================================================#

class UserData:

	#==========================================================================================#
	# >>>>> СОЗДАНИЕ НОВОГО ПОЛЬЗОВАТЕЛЯ <<<<< #
	#==========================================================================================#

	def __CreateUser(self):
		# Создание экземпляра пользователя.
		self.__User = {
			"Size": 0,
			"Premium": False, 
			"UnloadedFiles": []
		}

		# Создание папки файлов пользователя.
		os.makedirs("Data/Files/" + self.__UserID)

		# Создание папки архивов пользователя.
		os.makedirs("Data/Archives/" + self.__UserID)

		# Сохранение файла пользователя.
		self.__Save()

	#==========================================================================================#
	# >>>>> СОХРАНЕНИЕ ДАННЫХ ПОЛЬЗОВАТЕЛЯ <<<<< #
	#==========================================================================================#

	def __Save(self):
		# Сохранение файла пользователя.
		WriteJSON("Data/Users/" + self.__UserID + ".json", self.__User)

	#==========================================================================================#
	# >>>>> КОНСТРУКТОР <<<<< #
	#==========================================================================================#
		
	def __init__(self, UserID: str):

		# ID пользователя.
		self.__UserID = str(UserID)
		
		# Данные пользователя.
		self.__User = None

		# Список названий файлов в директории пользователя.
		Files = list()

		# Получение списка файлов в директории.
		Files = os.listdir("Data/Users")
		
		# Фильтрация только файлов формата JSON.
		Files = list(filter(lambda x: x.endswith(".json"), Files))

		# Если пользователя не существует.
		if self.__UserID + ".json" not in Files:
			self.__CreateUser()

		# Иначе читаем данные пользователя.
		else:
			self.__User = ReadJSON("Data/Users/" + self.__UserID + ".json")


	#==========================================================================================#
	# >>>>> ПОЛУЧЕНИЕ ID ПОЛЬЗОВАТЕЛЯ <<<<< #
	#==========================================================================================#
			
	def GetUserID(self) -> str:
		# Получение Id пользователя.
		return self.__UserID

	#==========================================================================================#
	# >>>>> ОБНОВЛЕНИЕ ДАННЫХ ПОЛЬЗОВАТЕЛЯ <<<<< #
	#==========================================================================================#

	def UpdateUser(self, Key: str, Value: any, Action: str) -> dict:
		# Если надо заменить значение в json файле.
		if Action == "Update":
			self.__User[Key] = Value

		# Если надо добавить значение в json файле.
		if Action == "Add":
			self.__User[Key].append(Value)

		# Сохранение файла пользователя.
		self.__Save()

		return self.__User
	
	#==========================================================================================#
	# >>>>> ПОЛУЧЕНИЕ ЗНАЧЕНИЙ ИЗ JSON ФАЙЛА ПОЛЬЗОВАТЕЛЯ <<<<< #
	#==========================================================================================#
	 
	def GetInfo(self, UserID: str, Key: str)-> any:
		# Получение значения в файле json.
		Value = ReadJSON("Data/Users/" + UserID + ".json")[Key]
	
		return Value 


